package utils

const (
	ERR_MSG            = "что то пошло не так, попробуйте позже"
	ERR_MSG_2          = "что то пошло не так, попробуйте еще: "
	SUCCESS_DELETE_BOT = "бот успешно удален"
	SUCCESS_ADDED_BOT  = "бот успешно создан"
)

const (
	NEW_ADMIN_MSG          = "Укажите username нового админа без '@' пример: adminchik0 вместо @adminchik"
	NEW_BOT_MSG            = "Укажите токен нового бота:"
	DELETE_BOT_MSG         = "Укажите id бота которого нужно удалить:"
	ADD_CH_TO_BOT_MSG      = "Укажите id бота для которого нужно добавить канал:"
	NEW_GROUP_LINK_MSG     = "Укажите название новой группы-ссылки и саму ссылку которую подставлять в таком формате -> моя группа 1:::ya.ru"
	EDIT_BOT_GROUP_LINK_MSG = "Укажите id бота для которого нужно поменять группу-ссылку и id группы-ссылки в таком формате -> 5644138609:::17"
	DELETE_GROUP_LINK_MSG  = "Укажите id группы-ссылки которого нужно удалить:"
	UPDATE_GROUP_LINK_MSG  = "Укажите id группы-ссылки которую нужно поменять:"
	GROUP_LINK_FOR_BOT_MSG = "укажите номер группы-ссылки для нового бота[%d"
	GROUP_LINK_UPDATE_MSG  = "укажите новую ссылку для ref [%d"
)
